## Staging: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 11 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                      NAME                      |
|--------|------------------------------------------------|
| add    | `aws_iam_policy.lambda_xray`                   |
|        | `aws_iam_role_policy_attachment.lambda_xray`   |
| update | `aws_lambda_function.api_end_to_end_test`      |
|        | `aws_lambda_function.audit_logs`               |
|        | `aws_lambda_function.audit_logs_archiver`      |
|        | `aws_lambda_function.form_archiver`            |
|        | `aws_lambda_function.nagware`                  |
|        | `aws_lambda_function.prisma_migration`         |
|        | `aws_lambda_function.reliability`              |
|        | `aws_lambda_function.reliability_dlq_consumer` |
|        | `aws_lambda_function.response_archiver`        |
|        | `aws_lambda_function.submission`               |
|        | `aws_lambda_function.vault_integrity`          |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_policy.lambda_xray will be created
  + resource "aws_iam_policy" "lambda_xray" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for allowing X-Ray tracing"
      + id               = (known after apply)
      + name             = "lambda_xray"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingStatisticSummaries",
                          + "xray:GetSamplingRules",
                          + "ssm:GetParameters",
                          + "logs:PutRetentionPolicy",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:DescribeLogGroups",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role_policy_attachment.lambda_xray will be created
  + resource "aws_iam_role_policy_attachment" "lambda_xray" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "iam_for_lambda"
    }

  # aws_lambda_function.api_end_to_end_test will be updated in-place
  ~ resource "aws_lambda_function" "api_end_to_end_test" {
        id                             = "api-end-to-end-test"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.audit_logs will be updated in-place
  ~ resource "aws_lambda_function" "audit_logs" {
        id                             = "audit-logs"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.audit_logs_archiver will be updated in-place
  ~ resource "aws_lambda_function" "audit_logs_archiver" {
        id                             = "audit-logs-archiver"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.form_archiver will be updated in-place
  ~ resource "aws_lambda_function" "form_archiver" {
        id                             = "form-archiver"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.nagware will be updated in-place
  ~ resource "aws_lambda_function" "nagware" {
        id                             = "nagware"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.prisma_migration will be updated in-place
  ~ resource "aws_lambda_function" "prisma_migration" {
        id                             = "prisma-migration"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability will be updated in-place
  ~ resource "aws_lambda_function" "reliability" {
        id                             = "reliability"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability_dlq_consumer will be updated in-place
  ~ resource "aws_lambda_function" "reliability_dlq_consumer" {
        id                             = "reliability-dlq-consumer"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.response_archiver will be updated in-place
  ~ resource "aws_lambda_function" "response_archiver" {
        id                             = "response-archiver"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.submission will be updated in-place
  ~ resource "aws_lambda_function" "submission" {
        id                             = "Submission"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.vault_integrity will be updated in-place
  ~ resource "aws_lambda_function" "vault_integrity" {
        id                             = "vault-integrity"
        tags                           = {}
        # (29 unchanged attributes hidden)

      ~ tracing_config {
          ~ mode = "PassThrough" -> "Active"
        }

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 11 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.api_end_to_end_test_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.audit_logs_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.file_upload_cleanup_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.form_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.nagware_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.response_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_end_to_end_test"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.file_upload"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.file_upload_cleanup"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.prisma_migration_handler"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing...
```

</details>
